<?php

/*
	Тут храним все базовые настройки которые нам необходимы. 
*/

namespace Parser;


class Settings {
	
	/* Адрес сервера например для отображения картинок
	 *пока не работает ищи по http в database.php
	*/ 
	public $server_address = "http://redmit.beget.tech/parser_v2/";
	public $mode; //Режим работы test || production

	/* Необходимые пути где будут лежать файлы */
	public $path = [
		"logs" =>  __DIR__ . "/.." . "/Logs",
		"images"  =>  __DIR__ . "/../"
	];

	public $antigate_apikey = "<api key here>"; //ключ для распознования капчи
	
	/* Сейчас используется proxymarket */
	public $proxy6_apikey = "<api key here>"; //Ключ для получения прокси
	public $proxymarket_apikey = "<api key here>"; //Ключ для получения прокси

	//Конфиг для подключения к БД
	public $db_config = [
		"test" => [
			'servername' => 'localhost',
			'database' => 'redmit_test',
			'username' => 'redmit_test',
			'password' => 'pass'
		],
		"production" => [
			'servername' => 'localhost',
			'database' => 'redmit_realt',
			'username' => 'redmit_realt',
			'password' => 'pass'
		]
	];

	/* листы котрые мы используем для выгрузки данных из бд */
	public $sheet_list = [
		"realt_data" => [
			"test" => "<id>",
			"production" => "<id>"
		]
	];

	/* Диапазон ячеек. Нужен для выгрузки в листы */
	public $sheet_ranges = [
		'general_all' => 'Data!A2:AL9999',
		'general_all_template' => 'Data!A%s:AL%s',
		'general_update_template' => 'Data!N%s:AL%s',
		
		'market_data_all' => 'Market!A2:N9999'
	];

	/* 
		условия поиска. как правило тут указывается гео, тип квартиры и прочие фильтры
		От источника к источнику эти параметры могут меняться
	*/
	public $search_conditions = [
		"cian" => [
			"test" => '{"jsonQuery":{"_type":"flatsale","geo":{"type":"geo","value":[{"type":"polygon","name":"Область поиска","coordinates":[["37.708","55.9247"],["37.7732","55.91"],["37.7643","55.9052"],["37.7574","55.9008"],["37.7492","55.8967"],["37.7378","55.8938"],["37.7351","55.9002"],["37.7317","55.9064"],["37.7347","55.9122"],["37.744","55.9158"]]}]},"engine_version":{"type":"term","value":2},"room":{"type":"terms","value":[1,2]},"page":{"type":"term","value":2}}}',

			"production" => '{"jsonQuery":{"_type":"flatsale","geo":{"type":"geo","value":[{"type":"polygon","name":"Область поиска","coordinates":[["37.7191","55.886"],["37.717","55.887"],["37.715","55.8882"],["37.7132","55.8893"],["37.7112","55.8903"],["37.7091","55.8911"],["37.7067","55.8918"],["37.7043","55.8926"],["37.7022","55.8934"],["37.6997","55.8941"],["37.6971","55.8944"],["37.6946","55.8946"],["37.692","55.8948"],["37.6907","55.8962"],["37.691","55.8979"],["37.6904","55.8995"],["37.6903","55.901"],["37.6907","55.9026"],["37.6915","55.9041"],["37.6928","55.9058"],["37.6941","55.907"],["37.6954","55.9085"],["37.6968","55.9099"],["37.6987","55.9111"],["37.7007","55.9124"],["37.702","55.9137"],["37.7031","55.9155"],["37.7043","55.9171"],["37.7052","55.9186"],["37.7061","55.9201"],["37.7073","55.9214"],["37.7089","55.9229"],["37.7108","55.9239"],["37.7126","55.9251"],["37.7148","55.9262"],["37.7169","55.9274"],["37.7187","55.9284"],["37.7212","55.9296"],["37.7229","55.9308"],["37.7241","55.9321"],["37.7263","55.933"],["37.7285","55.9338"],["37.7311","55.9341"],["37.7337","55.9343"],["37.7365","55.9344"],["37.7392","55.9344"],["37.7419","55.9342"],["37.7448","55.9339"],["37.7473","55.9335"],["37.7498","55.9331"],["37.7526","55.9329"],["37.7552","55.9328"],["37.758","55.9329"],["37.7609","55.9327"],["37.7636","55.9324"],["37.7662","55.9322"],["37.7696","55.9319"],["37.7719","55.9303"],["37.7745","55.9308"],["37.7771","55.9311"],["37.7798","55.9308"],["37.7824","55.9305"],["37.7852","55.9304"],["37.7879","55.9304"],["37.7904","55.9303"],["37.7932","55.9302"],["37.796","55.9302"],["37.7988","55.9302"],["37.8014","55.9302"],["37.8022","55.9287"],["37.8011","55.9273"],["37.7998","55.926"],["37.7987","55.9244"],["37.7974","55.9231"],["37.7962","55.9218"],["37.7949","55.9203"],["37.7938","55.9189"],["37.7923","55.9176"],["37.7911","55.9163"],["37.7893","55.9152"],["37.7869","55.9145"],["37.7847","55.9135"],["37.7826","55.9124"],["37.7806","55.9115"],["37.7785","55.9106"],["37.7761","55.91"],["37.7737","55.9095"],["37.7715","55.9087"],["37.769","55.9081"],["37.7665","55.9074"],["37.7643","55.9066"],["37.7626","55.9055"],["37.7606","55.9044"],["37.7591","55.903"],["37.7576","55.9018"],["37.756","55.9007"],["37.7543","55.8995"],["37.7525","55.8984"],["37.7512","55.8972"],["37.7497","55.896"],["37.7481","55.8947"],["37.7469","55.8934"],["37.745","55.8923"],["37.7432","55.8912"],["37.7411","55.8903"],["37.7392","55.8893"],["37.7372","55.8883"],["37.7352","55.8873"],["37.7331","55.8864"],["37.7309","55.8855"],["37.7285","55.885"],["37.7257","55.8847"],["37.7231","55.8849"],["37.7206","55.8854"],["37.7183","55.8862"],["37.7191","55.886"]]}]},"engine_version":{"type":"term","value":2},"room":{"type":"terms","value":[1,2]},"page":{"type":"term","value":2}},"subdomain":"www"}'

		],
		"avito" => [
			"test" => '&params[201]=1059&params[549][]=5697&params[549][]=5696&params[110472][]=437131&params[578-to]=90&categoryId=24&locationId=638920',
			"production" => '&params[201]=1059&params[549][]=5697&params[549][]=5696&categoryId=24&locationId=638920'
		]
	];

	/**
	 * В конструктор передаем режим работы test || production
	 * @param string $mode
	*/
	function __construct($mode) {

		setlocale(LC_TIME, 'ru_RU');

		$this->mode = $mode;

		//отбираем все данные согласно нашему режиму
		$this->db_config = $this->db_config[$this->mode];
		$this->sheet_list['realt_data'] = $this->sheet_list['realt_data'][$this->mode];
		$this->search_conditions['cian'] = $this->search_conditions['cian'][$this->mode];
		$this->search_conditions['avito'] = $this->search_conditions['avito'][$this->mode];

		//sheet ranges here.. left

	}
}

?>